{
  "Conservative": {
    "tenets": "Emphasizes tradition, social stability, limited government in markets, strong national defense, respect for institutions and norms.",
    "history": "Roots in reaction to radical change in 18th–19th century Europe. In U.S., grew via 20th-century classical liberal economic ideas mixed with social conservatism.",
    "popularity": "Strong in U.S. Republican base; conservative parties and media have influence globally, though levels vary.",
    "current_figures": "Examples: Ronald Reagan (historical), Margaret Thatcher (UK), more recently prominent voices in GOP and conservative media.",
    "philosophers": [
      {
        "name": "Edmund Burke",
        "works": "Reflections on the Revolution in France (1790)",
        "notes": "Prudence, respect for tradition, caution toward radical change"
      },
      {
        "name": "Michael Oakeshott",
        "works": "Rationalism in Politics (1962)",
        "notes": "Skepticism of grand design and rationalist planning"
      }
    ],
    "media_outlets": [
      "Fox News",
      "The Daily Caller",
      "One America News Network (OANN)",
      "The Washington Free Beacon",
      "National Review"
    ]
  },
  "Progressive": {
    "tenets": "Advocates equity, strong regulatory state, social justice, public goods, expansion of civil rights, active government role.",
    "history": "U.S. Progressive Era (1890s–1920s), later civil rights era, modern progressive movements, left reform traditions globally.",
    "popularity": "Core of progressive wings within left-of-center parties (e.g. Democrats in U.S.); parallels in social-democratic/green parties globally.",
    "current_figures": "Examples: Franklin D. Roosevelt, Lyndon Johnson (historical); modern progressive U.S. politicians, movements around climate policy, social welfare.",
    "philosophers": [
      {
        "name": "John Dewey",
        "works": "Democracy and Education (1916)",
        "notes": "Pragmatic democracy, education as social tool"
      },
      {
        "name": "Amartya Sen",
        "works": "Development as Freedom (1999)",
        "notes": "Capabilities approach, justice, development"
      }
    ],
    "media_outlets": [
      "NPR",
      "The Atlantic",
      "Vox",
      "HuffPost",
      "Mother Jones"
    ]
  },

  "Neoclassical": {
  "tenets": "Focuses on rational decision-making by individuals seeking to maximize utility and firms seeking to maximize profit. Markets are viewed as efficient mechanisms for allocating resources through the price system, with equilibrium reached when supply equals demand.",
  "history": "Emerging in the late 19th century through the works of William Stanley Jevons, Léon Walras, and Alfred Marshall, neoclassical economics refined classical thought by introducing marginal analysis and mathematical modeling. It became the dominant paradigm in the 20th century and remains central to mainstream economics.",
  "popularity": "Highly influential in economic policy, academia, and institutions such as central banks, the IMF, and World Bank. Its emphasis on efficiency and rationality remains a cornerstone of most modern economic models.",
  "current_figures": "Modern advocates include economists such as Robert Lucas and Gregory Mankiw. Institutions like the University of Chicago and Harvard have long been centers of neoclassical thought.",
  "philosophers": [
    {
      "name": "Alfred Marshall",
      "works": "Principles of Economics (1890)",
      "notes": "Unified classical and marginalist ideas into a coherent microeconomic framework."
    },
    {
      "name": "Léon Walras",
      "works": "Elements of Pure Economics (1874)",
      "notes": "Developed general equilibrium theory — the foundation for modern market modeling."
    }
  ],
  "media_outlets": [
    "The Economist",
    "Financial Times",
    "Wall Street Journal (Markets & Economics)",
    "Bloomberg Economics",
    "Harvard Business Review"
  ]
},
  "Libertarian": {
    "tenets": "Maximum individual liberty, minimal government, free markets, strong property rights, skepticism of coercion or paternalism.",
    "history": "Derives from classical liberalism, with resurgence in 20th century via Austrian economics, public choice, civil-liberties movements.",
    "popularity": "Smaller but notable niche in U.S. (Libertarian Party, think tanks), present in policy debates and international free-market networks.",
    "current_figures": "Examples: Friedrich Hayek, Milton Friedman (historical); current voices in think tanks, digital media, academia.",
    "philosophers": [
      {
        "name": "F. A. Hayek",
        "works": "The Road to Serfdom (1944)",
        "notes": "Knowledge problems, spontaneous order"
      },
      {
        "name": "Robert Nozick",
        "works": "Anarchy, State, and Utopia (1974)",
        "notes": "Minimal state, rights-based constraints"
      }
    ],
    "media_outlets": [
      "Reason Magazine",
      "Cato Institute Media",
      "Mises Institute",
      "Liberty.me",
      "Laissez-Faire Book Clubs / associated podcasts"
    ]
  },
  "Keynesian": {
    "tenets": "Active macroeconomic policy, counter-cyclical fiscal and monetary intervention, pursuit of full employment and stability.",
    "history": "Originates with John Maynard Keynes in 1930s; dominant mid-20th century; evolved to New Keynesian frameworks.",
    "popularity": "Influential in governmental economics, central banks, especially in volatile periods; mainstream in many countries’ economic policy toolkits.",
    "current_figures": "John Maynard Keynes (historical); modern economists in central banking, academia, ministerial advisors.",
    "philosophers": [
      {
        "name": "John Maynard Keynes",
        "works": "The General Theory of Employment, Interest and Money (1936)",
        "notes": "Effective demand, liquidity preference, fiscal policy"
      },
      {
        "name": "James Tobin",
        "works": "Essays in Economics",
        "notes": "Portfolio selection, stabilization, bridging Keynesian and financial markets"
      }
    ],
    "media_outlets": [
      "The Economist",
      "Financial Times",
      "Bloomberg Opinion",
      "Vox Economics sections"
    ]
  }
},
"Green/New Deal": {
  "tenets": "Advocates rapid transition to renewable energy, large-scale public investment in green infrastructure, and social equity initiatives to ensure climate action benefits workers and marginalized communities. Emphasizes sustainability, decarbonization, and just economic transformation.",
  "history": "Rooted in environmental and labor movements of the late 20th century, gaining renewed traction after 2018 when U.S. legislators introduced the Green New Deal framework. Inspired by Franklin D. Roosevelt’s original New Deal but centered on climate change and economic justice.",
  "popularity": "Increasingly popular among younger voters and progressive policymakers. Adopted in various forms by the EU Green Deal, Canada’s Just Transition framework, and local U.S. initiatives.",
  "current_figures": "Alexandria Ocasio-Cortez, Ed Markey, Greta Thunberg, and Naomi Klein are prominent public advocates; numerous climate economists and environmental NGOs promote its ideas globally.",
  "philosophers": [
    {
      "name": "Naomi Klein",
      "works": "This Changes Everything (2014)",
      "notes": "Links climate crisis with capitalism and systemic inequality."
    },
    {
      "name": "Kate Raworth",
      "works": "Doughnut Economics (2017)",
      "notes": "Proposes an ecological and social boundary model for sustainable development."
    }
  ],
  "media_outlets": [
    "Grist",
    "Inside Climate News",
    "The Guardian (Environment Section)",
    "Democracy Now!",
    "Bloomberg Green"
  ]
}
